export const aiErrorMessages = [
  'К сожалению, иногда генеративные языковые модели могут создавать некорректные ответы, основанные на открытых источниках. Во избежание неправильного толкования, ответы на вопросы, связанные с чувствительными темами, временно ограничены. Благодарим за понимание.',
  'Есть темы, в которых я могу ошибиться. Лучше промолчу.',
  'Извините, но я не могу помочь с этим запросом.',
  'Мои ответы могут быть неточными или неполными, поэтому я предпочитаю не отвечать на этот вопрос.',
  'Этот вопрос выходит за пределы моих возможностей, и я не могу дать вам ответ.',
  'Прошу прощения, но я не могу предоставить информацию по этому запросу.',
  'Ответ на этот вопрос может быть спорным, поэтому я не стану давать ответ.',
  'Моя модель не может точно ответить на этот вопрос, пожалуйста, обратитесь к другому источнику.',
  'Эта тема слишком сложна или неоднозначна для моего понимания, и я воздержусь от ответа.',
  'Моя модель не предназначена для обработки такого типа запросов.',
  'Как и любая языковая модель, GigaChat не обладает собственным мнением и не транслирует мнение своих разработчиков. Ответ сгенерирован нейросетевой моделью, обученной на открытых данных, в которых может содержаться неточная или ошибочная информация. Во избежание неправильного толкования, разговоры на некоторые темы временно ограничены.',
  'На этот вопрос я не отвечу, потому что не очень разбираюсь.'
]
